---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpaceIsOccupiable
source: html/cd5994b1-727e-2b83-4861-b58545eb9e6a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpaceIsOccupiable Property

"Occupiable"

## Syntax (C#)
```csharp
public static ForgeTypeId SpaceIsOccupiable { get; }
```